Tasks/СоздатьМодельГабаритногоЧертежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>СоздатьМодельГабаритногоЧертежа</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наблюдатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Enums/СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПриостановкаРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧ_Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧ_Проверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаЗадача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаЗадачаРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Замер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажПередача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеГЧ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисвоенНомерPDM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоМалярка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоМалярка2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОгрузкаЧастичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОтгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПодрядчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПодрядчик2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоУпаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазработкаРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РКД_ожидание_согласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеЭлемента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВнешнееОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВнутреннееОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗРекламация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗадачКонструирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗадачКонструирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводствоГотово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводствоОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерИзменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерПроектный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерРабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерСоздан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Финдиректор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/СоздатьМодельГабаритногоЧертежа/Ext/ManagerModule.bsl
Функция ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель = Неопределено) Экспорт
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;

	ОбъектЗадача 				= Задача.ПолучитьОбъект();
	ОбъектЗадача.Дата 			= ТекущаяДата();
	ОбъектЗадача.СтатусЗадачи   = Перечисления.СтатусыЗадач.Замер;
	
	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьОбщиеЗадачи(Задача);
	ИначеЕсли Действие = "НачатьВыполнение" Тогда
		
		СтрокаХМЛ = омФайлыPDM.Перевести_ГЧ_в_изменение_статус(ОбъектЗадача.ОбъектТЗ);
		СтруктураОтвета = омФайлыPDM.ПреобразоватьОтветОСменеСтатусаГЧВСтруктуру(СтрокаХМЛ);
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ЗамерИзменение;
		ОбъектЗадача.Исполнитель 	= Исполнитель;
		
		ОбъектЗадача.Записать();
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПустаяСсылка(), Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	ИначеЕсли Действие = "ЗавершитьВыполнение" Тогда
		
		СтрокаХМЛ = омФайлыPDM.Перевести_ГЧ_в_проектный_статус(ОбъектЗадача.ОбъектТЗ);
		СтруктураОтвета = омФайлыPDM.ПреобразоватьОтветОСменеСтатусаГЧВСтруктуру(СтрокаХМЛ);
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Завершение;
		ОбъектЗадача.Исполнитель 	= Исполнитель;
		ОбъектЗадача.Выполнена		= Истина;
		
		ОбъектЗадача.Записать();
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПустаяСсылка(), Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	ИначеЕсли Действие = "Сброс" Тогда
		
		СтрокаХМЛ = омФайлыPDM.Перевести_ГЧ_в_проектный_статус(ОбъектЗадача.ОбъектТЗ);
		СтруктураОтвета = омФайлыPDM.ПреобразоватьОтветОСменеСтатусаГЧВСтруктуру(СтрокаХМЛ);
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ЗамерПроектный;
		ОбъектЗадача.Исполнитель 	= Исполнитель;
		
		ОбъектЗадача.Записать();
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПустаяСсылка(), Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	КонецЕсли;
	
	СсылкаНаЗадачу = ОбъектЗадача.Ссылка;
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(СсылкаНаЗадачу);

	Возврат СтруктураОтвета;
	
КонецФункции // ДействияНаСервере()
